using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CodeTest
{
    public enum ProgramNameEnum
    {
        سبا = 1,
        سپاس = 2,
        هوشمند__دلفارد___ = 3,
        آریانا__شیخ_بهائی___ = 4,
        پیشرو__ماجد___ = 5,
        آوا = 6,
        آبان = 7,
        دری = 8,
        بیتا__دری___ = 9,
        سبا_جدید__lebls___ = 10,
        ارس__دری___ = 11,
        شارین = 12,
        الماس__سافر___ = 13,
        کاووش = 14,
        سها = 15,
        آسان = 16,
        ترانس__Trans___ = 17,
        آریا = 18,
        سهاسپند = 19,
        سایر = 20
    }

    public enum ActivityTypeEnum
    {
        نا_مشخص = 0,
        ورود = 1,
        خروج = 2,
        ثبت = 3,
        ویرایش = 4,
        حذف = 5,
        مشاهده = 6,
        گزارش = 7,
        تاييد = 8,
        ابطال = 9,
        جستجو = 10,
        جستجوی_تفکیکی = 11,
        جستجوی_وضعیت_ارسال = 12,
        بررسی = 13,
        کارشناسی = 14,
        کنترل_پرداخت = 15,
        تولید_فایل_متنی_بیمه = 16,
        تولید_فایل_اکسس_بیمه = 17,
        تایید_افزایش_سقف_قرارداد = 18,
        رد_افزایش_سقف_قرارداد = 19,

        تعیین_سطح_دسترسی = 20,
        تایید_پرداخت = 21,
        انتخاب_ویرایش = 22,
        رد = 23,
        انتخاب_وسیله_نقلیه = 24,
        انتخاب_کالا = 25,
        ویرایش_کرایه_حمل_و_ارزش_محموله = 26,
        ویرایش_درخواست_نصب_ترنسپرتال = 27,
        تایید = 28,
        تعلیق = 29,
        انجام = 30,
        ثبت_توضیحات = 31,
        رد_انجام = 32,
        لغو_تعلیق = 33,
        لغو_ارجاع = 34,
        ثبت_توضیحات_پرداخت = 35,
        ثبت_توضیح = 36,
        ارجاع = 37,
        ثبت_انجام = 38,
        رفع_تعلیق = 39,
        ثبت_و_تایید = 40,
        ثبت_ارجاع_و_تایید = 41,
        ثبت_ارجاع_به_خود_و_تایید = 42,
        حذف_موقت = 43,
        بازگردانی = 44,
        ویرایش_توضیحات_کارشناسان = 45,
        رمز = 46,
        محاسبه_مجدد_نرخ = 47,
        چاپ = 48,
        اکسل = 49,
        ثبت_انلاین = 50,
        ثبت_انلاین_گروهی = 50
    }
}
